// --- 1. 基礎數據與配置 ---

const CHARACTER_POSITIONS = {
    "愛梅斯": 805, "艾姬多娜（夏日）": 795, "艾姬多娜": 795,
    "可璃亞": 128, "可璃亞（夏日）": 128, "日和": 153, "日和（薩拉薩利亞）": 153, "日和（星界）": 168,
    "真琴": 165, "月月": 165, "真琴（指揮官）": 165, "月月（指揮官）": 165,
    "梅杜莎": 345, "小梅": 345, "格蕾斯": 345, "克莉絲提娜": 395, "克莉絲提娜（始源）": 395, "克": 395,
    "惠理子": 251, "病嬌": 251, "惠理子（指揮官）": 251, "病嬌（指揮官）": 251,
    "薇歐莉特": 535, "堇": 535, "若菜": 545, "普蕾西亞（夏日）": 575, "水豬妹": 575, "克蘿茜（風靈）": 622,
    "鳳凰": 685, "涅妃＝涅羅": 721, "栞（遊俠）": 735, "狼栞": 735, "帆稀": 761, "帆稀（夏日）": 782,
    "凱留（公主）": 795, "公黑": 795, "菲歐": 805, "涅婭（夏日）": 818, "志那都": 761, "可璃亞（學園）": 128
};

const NICKNAME_MAP = {
    "水豬妹": "普蕾西亞（夏日）", "泳豬": "普蕾西亞（夏日）", "水璃亞": "可璃亞（夏日）", "學碧": "可璃亞（學園）", "狼栞": "栞（遊俠）",
    "公黑": "凱留（公主）", "黑貓": "凱留（公主）", "黑猫": "凱留（公主）",
    "水莉莉": "莉莉（夏日）", "聖克": "克莉絲提娜（聖誕）", "圣克": "克莉絲提娜（聖誕）",
    "白貓": "凱留（公主）", "白猫": "凱留（公主）", "堇": "薇歐莉特", 
    "紫羅蘭": "薇歐莉特", "紫罗兰": "薇歐莉特", "月月": "真琴", 
    "小梅": "梅杜莎", "美杜莎": "梅杜莎", "病嬌": "惠理子（指揮官）", "惠理子": "惠理子（指揮官）",
    "真琴（指揮官）": "真琴（指揮官）", "月月（指揮官）": "真琴（指揮官）",
    "克": "克莉絲提娜", "始源克": "克莉絲提娜（始源）",
    "蘭法龍": "蘭法", "兰法龙": "蘭法", "蘭法": "蘭法", "兰法": "蘭法",
    "多娜": "艾姬多娜（夏日）", "水厄": "艾姬多娜（夏日）", "艾姬多娜(夏)": "艾姬多娜（夏日）",
    "聖姐": "愛梅斯", "天姐": "愛梅斯", "愛梅斯": "愛梅斯",
    "水優妮": "優妮（夏日）", "白菲": "雪菲", "切嚕": "琪愛兒", "流夏": "流夏"
};
